<a href="https://colab.research.google.com/github/mohd-faizy/_Pandas_CodeDump/blob/master/08_Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

--- 
<strong> 
    <h1 align='center'>Groupby</h1> 
</strong>

---



The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['google','google','apple','microsoft','facebook','facebook','google','google'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','monika','mike'],
       'Sales':[200,120,340,124,243,350,281,291]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

     Company   Person  Sales
0     google      Sam    200
1     google  Charlie    120
2      apple      Amy    340
3  microsoft  Vanessa    124
4   facebook     Carl    243
5   facebook    Sarah    350
6     google   monika    281
7     google     mike    291

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [4]:
df.groupby('Company')

You can save this object as a new variable:

In [5]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [6]:
by_comp.mean()

           Sales
Company
apple      340.0
facebook   296.5
google     223.0
microsoft  124.0

In [7]:
df.groupby('Company').mean()

           Sales
Company
apple      340.0
facebook   296.5
google     223.0
microsoft  124.0

More examples of aggregate methods:

In [8]:
by_comp.std()

               Sales
Company
apple            NaN
facebook   75.660426
google     79.845685
microsoft        NaN

In [9]:
by_comp.min()

            Person  Sales
Company
apple          Amy    340
facebook      Carl    243
google     Charlie    120
microsoft  Vanessa    124

In [10]:
by_comp.max()

            Person  Sales
Company
apple          Amy    340
facebook     Sarah    350
google      monika    291
microsoft  Vanessa    124

In [11]:
by_comp.count()

           Person  Sales
Company
apple           1      1
facebook        2      2
google          4      4
microsoft       1      1

In [12]:
by_comp.describe()

          Sales
          count   mean        std    min     25%    50%     75%    max
Company
apple       1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0
facebook    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0
google      4.0  223.0  79.845685  120.0  180.00  240.5  283.50  291.0
microsoft   1.0  124.0        NaN  124.0  124.00  124.0  124.00  124.0

In [13]:
by_comp.describe().transpose()

Company      apple    facebook      google  microsoft
Sales count    1.0    2.000000    4.000000        1.0
      mean   340.0  296.500000  223.000000      124.0
      std      NaN   75.660426   79.845685        NaN
      min    340.0  243.000000  120.000000      124.0
      25%    340.0  269.750000  180.000000      124.0
      50%    340.0  296.500000  240.500000      124.0
      75%    340.0  323.250000  283.500000      124.0
      max    340.0  350.000000  291.000000      124.0

In [14]:
by_comp.describe().transpose()['google']

Sales  count      4.000000
       mean     223.000000
       std       79.845685
       min      120.000000
       25%      180.000000
       50%      240.500000
       75%      283.500000
       max      291.000000
Name: google, dtype: float64